<a href="https://colab.research.google.com/github/HwangHanJae/datascience-basic-tect/blob/main/pandas_10minutes_tutorial.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

# Pandas Tutorial
- 10 minutes to pandas

# 라이브러리 로드

In [2]:
import numpy as np
import pandas as pd

# 객체 생성

value의 리스트를 전달하여 Series 타입을 생성하고 pandas의 기본 인덱스를 적용합니다.

In [3]:
#Input
s = pd.Series([1,3,5, np.nan, 6,8])
#Output
s

0    1.0
1    3.0
2    5.0
3    NaN
4    6.0
5    8.0
dtype: float64

datatime 타입과 레이블이있는 column과 Numpy array를 전달하여 Dataframe을 생성합니다.

In [4]:
dates = pd.date_range("20130101", periods=6)
dates

DatetimeIndex(['2013-01-01', '2013-01-02', '2013-01-03', '2013-01-04',
               '2013-01-05', '2013-01-06'],
              dtype='datetime64[ns]', freq='D')

In [5]:
df = pd.DataFrame(np.random.randn(6,4), index=dates, columns=list("ABCD"))
df

                   A         B         C         D
2013-01-01 -1.000343  0.333847  0.286298  0.859793
2013-01-02 -0.004857 -0.177974  0.385825  1.554768
2013-01-03  0.407483 -1.687128 -0.520544 -0.295606
2013-01-04 -0.407866  0.007623  0.969567 -0.491418
2013-01-05  1.018708  0.650734 -0.782426 -0.540248
2013-01-06  0.766974 -2.382374 -0.656205 -0.551555

Series 타입처럼 변환할수 있는 객체의 dict 타입을 전달하여 DataFrame을 생성합니다.

In [6]:
df2 = pd.DataFrame(
    {"A" : 1.0,
    "B" : pd.Timestamp("20130102"),
    "C" : pd.Series(1, index=list(range(4)), dtype="float32"),
    "D" : np.array([3] *4, dtype="int32"),
    "E" : pd.Categorical(["test","train","test","train"]),
    "F" : 'foo',}
)

df2

     A          B    C  D      E    F
0  1.0 2013-01-02  1.0  3   test  foo
1  1.0 2013-01-02  1.0  3  train  foo
2  1.0 2013-01-02  1.0  3   test  foo
3  1.0 2013-01-02  1.0  3  train  foo

Dataframe의 columns 들은 다른 dtypes를 가지고 있습니다.

In [7]:
df2.dtypes

A           float64
B    datetime64[ns]
C           float32
D             int32
E          category
F            object
dtype: object

# 데이터 관찰

데이터 프레임의 상단, 하단을 보는 방법입니다.

In [8]:
df.head()

                   A         B         C         D
2013-01-01 -1.000343  0.333847  0.286298  0.859793
2013-01-02 -0.004857 -0.177974  0.385825  1.554768
2013-01-03  0.407483 -1.687128 -0.520544 -0.295606
2013-01-04 -0.407866  0.007623  0.969567 -0.491418
2013-01-05  1.018708  0.650734 -0.782426 -0.540248

In [9]:
df.tail()

                   A         B         C         D
2013-01-02 -0.004857 -0.177974  0.385825  1.554768
2013-01-03  0.407483 -1.687128 -0.520544 -0.295606
2013-01-04 -0.407866  0.007623  0.969567 -0.491418
2013-01-05  1.018708  0.650734 -0.782426 -0.540248
2013-01-06  0.766974 -2.382374 -0.656205 -0.551555

index, columns를 표현합니다.

In [10]:
df.index

DatetimeIndex(['2013-01-01', '2013-01-02', '2013-01-03', '2013-01-04',
               '2013-01-05', '2013-01-06'],
              dtype='datetime64[ns]', freq='D')

In [11]:
df.columns

Index(['A', 'B', 'C', 'D'], dtype='object')

DataFrame.to_numpy()는 NumPy 표현을 제공합니다.

In [15]:
df

                   A         B         C         D
2013-01-01 -1.000343  0.333847  0.286298  0.859793
2013-01-02 -0.004857 -0.177974  0.385825  1.554768
2013-01-03  0.407483 -1.687128 -0.520544 -0.295606
2013-01-04 -0.407866  0.007623  0.969567 -0.491418
2013-01-05  1.018708  0.650734 -0.782426 -0.540248
2013-01-06  0.766974 -2.382374 -0.656205 -0.551555

In [12]:
df.to_numpy()

array([[-1.00034251,  0.33384742,  0.28629838,  0.8597935 ],
       [-0.0048573 , -0.17797438,  0.38582458,  1.55476792],
       [ 0.40748297, -1.68712816, -0.52054411, -0.29560612],
       [-0.40786642,  0.00762306,  0.96956651, -0.49141832],
       [ 1.01870823,  0.6507345 , -0.7824265 , -0.54024823],
       [ 0.76697414, -2.38237405, -0.65620543, -0.55155536]])

In [14]:
df2

     A          B    C  D      E    F
0  1.0 2013-01-02  1.0  3   test  foo
1  1.0 2013-01-02  1.0  3  train  foo
2  1.0 2013-01-02  1.0  3   test  foo
3  1.0 2013-01-02  1.0  3  train  foo

In [13]:
df2.to_numpy()

array([[1.0, Timestamp('2013-01-02 00:00:00'), 1.0, 3, 'test', 'foo'],
       [1.0, Timestamp('2013-01-02 00:00:00'), 1.0, 3, 'train', 'foo'],
       [1.0, Timestamp('2013-01-02 00:00:00'), 1.0, 3, 'test', 'foo'],
       [1.0, Timestamp('2013-01-02 00:00:00'), 1.0, 3, 'train', 'foo']],
      dtype=object)

DataFrame.to_numpy()는 index와 columns를 포함하지 않습니다.

Data를 T(transpose)합니다.

In [18]:
df

                   A         B         C         D
2013-01-01 -1.000343  0.333847  0.286298  0.859793
2013-01-02 -0.004857 -0.177974  0.385825  1.554768
2013-01-03  0.407483 -1.687128 -0.520544 -0.295606
2013-01-04 -0.407866  0.007623  0.969567 -0.491418
2013-01-05  1.018708  0.650734 -0.782426 -0.540248
2013-01-06  0.766974 -2.382374 -0.656205 -0.551555

In [17]:
df.T

   2013-01-01  2013-01-02  2013-01-03  2013-01-04  2013-01-05  2013-01-06
A   -1.000343   -0.004857    0.407483   -0.407866    1.018708    0.766974
B    0.333847   -0.177974   -1.687128    0.007623    0.650734   -2.382374
C    0.286298    0.385825   -0.520544    0.969567   -0.782426   -0.656205
D    0.859793    1.554768   -0.295606   -0.491418   -0.540248   -0.551555

axis=1(열)을 기준으로 정렬합니다.

In [20]:
df

                   A         B         C         D
2013-01-01 -1.000343  0.333847  0.286298  0.859793
2013-01-02 -0.004857 -0.177974  0.385825  1.554768
2013-01-03  0.407483 -1.687128 -0.520544 -0.295606
2013-01-04 -0.407866  0.007623  0.969567 -0.491418
2013-01-05  1.018708  0.650734 -0.782426 -0.540248
2013-01-06  0.766974 -2.382374 -0.656205 -0.551555

In [19]:
df.sort_index(axis=1, ascending=False)

                   D         C         B         A
2013-01-01  0.859793  0.286298  0.333847 -1.000343
2013-01-02  1.554768  0.385825 -0.177974 -0.004857
2013-01-03 -0.295606 -0.520544 -1.687128  0.407483
2013-01-04 -0.491418  0.969567  0.007623 -0.407866
2013-01-05 -0.540248 -0.782426  0.650734  1.018708
2013-01-06 -0.551555 -0.656205 -2.382374  0.766974

values를 기준으로 정렬합니다.

기본적으로 오름차순이 적용됩니다. ascending = True

In [21]:
df.sort_values(by="B")

                   A         B         C         D
2013-01-06  0.766974 -2.382374 -0.656205 -0.551555
2013-01-03  0.407483 -1.687128 -0.520544 -0.295606
2013-01-02 -0.004857 -0.177974  0.385825  1.554768
2013-01-04 -0.407866  0.007623  0.969567 -0.491418
2013-01-01 -1.000343  0.333847  0.286298  0.859793
2013-01-05  1.018708  0.650734 -0.782426 -0.540248